Ran Plan for 2 projects:

1. dir: `project1` workspace: `default`
1. dir: `project2` workspace: `default`

### 1. dir: `project1` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.bucket.google_storage_bucket.bucket_name["bucket-geeta13-bucket02"] will be created
+ resource "google_storage_bucket" "bucket_name" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "bucket-geeta13-bucket02"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # module.bucket.google_storage_bucket.bucket_name["bucket-geeta13-bucket03"] will be created
+ resource "google_storage_bucket" "bucket_name" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "bucket-geeta13-bucket03"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d project1`
* :put_litter_in_its_place: To **delete** this plan click [here](http://e6dfe01407c6:4141/lock?id=GeetaSree13%252Fterraform_new%252Fproject1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d project1`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. dir: `project2` workspace: `default`
<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vm.google_compute_firewall.allowing-http has been changed
~ resource "google_compute_firewall" "allowing-http" {
        id                      = "projects/stable-parsec-462607-h1/global/firewalls/allowing-http"
        name                    = "allowing-http"
      + source_service_accounts = []
      + source_tags             = []
      + target_service_accounts = []
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.vm.google_compute_firewall.allowing-https has been changed
~ resource "google_compute_firewall" "allowing-https" {
        id                      = "projects/stable-parsec-462607-h1/global/firewalls/allowing-https"
        name                    = "allowing-https"
      + source_service_accounts = []
      + source_tags             = []
      + target_service_accounts = []
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.vm.google_compute_instance.vm_instance has been changed
~ resource "google_compute_instance" "vm_instance" {
        id                   = "projects/stable-parsec-462607-h1/zones/asia-southeast1-a/instances/terraform-instance-project2"
      + labels               = {}
      + metadata             = {}
        name                 = "terraform-instance-project2"
      + resource_policies    = []
        tags                 = [
            "http-server",
            "https-server",
        ]
        # (16 unchanged attributes hidden)

      ~ boot_disk {
            # (6 unchanged attributes hidden)

          ~ initialize_params {
              + resource_manager_tags       = {}
                # (9 unchanged attributes hidden)
            }
        }



        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

No changes. Your infrastructure matches the configuration.

Your configuration already matches the changes detected above. If you'd like
to update the Terraform state to match, create and apply a refresh-only plan.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d project2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://e6dfe01407c6:4141/lock?id=GeetaSree13%252Fterraform_new%252Fproject2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d project2`
</details>


---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
